Revit 2025 API
IFCProjectLevelGUIDType Enumeration
 The type of the GUID to be retrieved from Revit.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum IFCProjectLevelGUIDType
Public Enumeration IFCProjectLevelGUIDType
public enum class IFCProjectLevelGUIDType
type IFCProjectLevelGUIDType
Members
Member name | Value | Description
Project | 0 |  The project GUID.
Building | 1 |  The building GUID.
Site | 2 |  The site GUID.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace